# Задание 1
# s = "Дана ст(рока символов, среди которых есть одга открыв)ающаяся"
# print(s[s.index('(') + 1:s.index(')')])


# Задание 2
str1 = "11, 23, 44, 55, 23, 22"
str2 = "23"
str3 = "!!!"

